# 小说PC站前端

### novel_column

ID    频道  字段类型         所属频道
6001  0    banner          首页
6002  0    男频人气榜        首页
6003  0    女频人气榜        首页
6004  0    左侧大字推           首页
6005  0    左侧小字推           首页
6012  0    右侧大字推           首页
6013  0    右侧小字推           首页
6006  0    资讯             首页
6007  0    女频火力强推       首页
6008  0    男频火力强推       首页
6009  0    免费更新榜         首页
6010  0    VIP更新榜         首页
6011  0    热搜             首页
6101  1    banner图         男频
6102  1    本周热推          男频
6103  1    大字推            男频
6104  1    小字推            男频
6105  1    精品推荐          男频
6106  1    分类推荐          男频
6161  1    男频人气榜         男频
6162  1    男频收藏榜         男频
6163  1    男频推荐榜         男频
6164  1    男频月票榜         男频
6165  1    男频新书榜         男频
6166  1    男频土豪榜         男频
6201  2    Banner图          女频
6202  2    本周热推           女频
6203  2    大字推            女频
6204  2    小字推            女频
6205  2    精品推荐          女频
6206  2    分类推荐          女频
6261  2    女频人气榜         女频
6262  2    女频收藏榜         女频
6263  2    女频推荐榜         女频
6264  2    女频月票榜         女频
6265  2    女频新书榜         女频
6266  2    女频土豪榜         女频
6301  3    banner           优质版权
6302  3    资讯              优质版权
6303  3    最新出售作品        优质版权
6304  3    精选版权推荐        优质版权

### 排行榜
总:0  日:1  周:2  月:3

### 书库详细参数介绍
* @param pageParam  : 分页参数
* @param channel ：  频道（1=男频、2=女频）
* @param type    ： 分类（全部、各种类型）
* @param tag   ： 标签（全部、各种标签）
* @param wordNumber： 字数（全部、1=30万以下、2=30-50万、3=50-100万、4=100万以上）
* @param updateTime： 时间（全部、1=三日内、2=七日内、3=半月内、4=一月内）
* @param option  ： 选项（全部、0=免费、1=收费）

### PC站小说详情中小说投月票和打赏的记录
type    1=充值记录   2=购买章节记录   3=打赏记录   4=代表月票   5=代表查询推荐票   6=打赏小说（需要小说ID）记录   7=小说投票记录

### 查询PC站小说详情中小说获取商品的数据
type   1=需要真钱付款的商品  2=月票商品--金币购买  3=打赏商品--金币购买  4=打赏商品（男频）--金币购买  5=打赏商品（女频）--金币购买

### 首页分类推荐
女['现代言情', '古代言情', '仙侠奇幻', '耽美纯爱'] : [6211, 6212, 6213, 6214]
男['现代都市', '悬疑灵异', '玄幻仙侠', '历史军事'] : [6111, 6112, 6113, 6114]

### 查询PC站小说详情数据
channel    1 = 男频   2 = 女频