var data = [
  {
    name: '良心佳作候选名单',
    list: [
      {
        id: 1,
        name: '美人鱼'
      },
      {
        id: 2,
        name: '箭士柳白猿'
      },
      {
        id: 3,
        name: '火锅英雄'
      },
      {
        id: 4,
        name: '树大招风'
      },
      {
        id: 5,
        name: '老笠'
      },
      {
        id: 6,
        name: '北京遇上西雅图之不二情书'
      },
      {
        id: 7,
        name: '百鸟朝凤'
      },
      {
        id: 8,
        name: '我不是王毛'
      },
      {
        id: 9,
        name: '惊天大逆转'
      },
      {
        id: 10,
        name: '寒战2'
      },
      {
        id: 11,
        name: '路边野餐'
      },
      {
        id: 12,
        name: '长江图'
      },
      {
        id: 13,
        name: '幸运是我'
      },
      {
        id: 14,
        name: '喊山'
      },
      {
        id: 15,
        name: '黑出有什么'
      },
      {
        id: 16,
        name: '湄公河行动'
      },
      {
        id: 17,
        name: '追凶者也'
      },
      {
        id: 18,
        name: '驴得水'
      },
      {
        id: 19,
        name: '七月与安生'
      },
      {
        id: 20,
        name: '我不是潘金莲'
      }
    ]
  },
  {
    name: '扑街烂片候选名单',
    list: [
      {
        id: 21,
        name: '澳门风云3'
      },
      {
        id: 22,
        name: '卧虎藏龙：青冥宝剑'
      },
      {
        id: 23,
        name: '梦想合伙人'
      },
      {
        id: 24,
        name: '大唐玄奘'
      },
      {
        id: 25,
        name: '赏金猎人'
      },
      {
        id: 26,
        name: '致青春·原来你还在这里'
      },
      {
        id: 27,
        name: '陆垚知马俐'
      },
      {
        id: 28,
        name: '封神传奇'
      },
      {
        id: 29,
        name: '盗墓笔记'
      },
      {
        id: 30,
        name: '夏有乔木 雅望天堂'
      },
      {
        id: 31,
        name: '我最好朋友的婚礼'
      },
      {
        id: 32,
        name: '微微一笑很倾城'
      },
      {
        id: 33,
        name: '那件疯狂的小事叫爱情'
      },
      {
        id: 34,
        name: '在世界中心呼唤爱'
      },
      {
        id: 35,
        name: '爵迹'
      },
      {
        id: 36,
        name: '从你的全世界路过'
      },
      {
        id: 37,
        name: '大话西游3'
      },
      {
        id: 38,
        name: '王牌逗王牌'
      },
      {
        id: 39,
        name: '惊天破'
      },
      {
        id: 40,
        name: '三少爷的剑'
      }
    ]
  },
  {
    name: '爆款网剧候选名单',
    list: [
      {
        id: 41,
        name: '老九门'
      },
      {
        id: 42,
        name: '余罪'
      },
      {
        id: 43,
        name: '美人为馅'
      },
      {
        id: 44,
        name: '上瘾'
      },
      {
        id: 45,
        name: '如果蜗牛有爱情'
      },
      {
        id: 46,
        name: '超少年密码'
      },
      {
        id: 47,
        name: '法医秦明'
      },
      {
        id: 48,
        name: '画江湖之不良人'
      },
      {
        id: 49,
        name: '陈二狗的妖孽人生'
      },
      {
        id: 50,
        name: '灵魂摆渡3'
      },
      {
        id: 51,
        name: '亲爱的公主病'
      },
      {
        id: 52,
        name: '校花的贴身高手'
      },
      {
        id: 53,
        name: '最好的我们'
      },
      {
        id: 54,
        name: '十宗罪'
      },
      {
        id: 55,
        name: '半妖倾城'
      },
      {
        id: 56,
        name: '重生之名流巨星'
      },
      {
        id: 57,
        name: '灭罪师'
      },
      {
        id: 58,
        name: '我的奇妙男友'
      },
      {
        id: 59,
        name: '心理罪'
      },
      {
        id: 60,
        name: '微微一笑很倾城'
      }
    ]
  }
];